Changed flowchart to mermaid
